/* eslint-disable prefer-const */
/* eslint-disable semi */
/* eslint-disable no-unused-vars */

'strict';

/*
1) Реализовать табы по видео.
2) В функции toggleMenu() много обработчиков событий. Используя делегирование событий, сделать обработчики для:

Крестика закрытия меню и пунктов меню.
На кнопку меню.
3) У вас должно быть максимум 2 обработчика события в функции toggleMenu()

дополнительное:
1) Написать 1 обработчик для всех событий внутри функции toggleMenu()
2) Реализовать следующий функционал: если клик произошел мимо меню, оно закрывается
*/

const tabs = () => {

};

export default tabs;
